### Zadanie 1

Stwórz dataframe z dzięsięcioma imionami uczniów i uczennic oraz liczbą punktów, jakie uzyskali z egzaminu. Następnie sprawdź, jaka była średnia i mediana wyników.

In [31]:
import pandas as pd

scores = {
    "Adam": 27,
    "Malwina": 28,
    "Beata": 25,
    "Michał": 17,
    "Franciszka": 25,
    "Paulina": 18,
    "Maciej": 20,
    "Piotr": 13,
    "Monika": 25,
    "Diana": 21
}

scores_df = pd.DataFrame(scores.items(), columns=["imię", "liczba punktów"])

In [32]:
scores_df

         imię  liczba punktów
0        Adam              27
1     Malwina              28
2       Beata              25
3      Michał              17
4  Franciszka              25
5     Paulina              18
6      Maciej              20
7       Piotr              13
8      Monika              25
9       Diana              21

In [33]:
scores_df.describe()

       liczba punktów
count       10.000000
mean        21.900000
std          4.886489
min         13.000000
25%         18.500000
50%         23.000000
75%         25.000000
max         28.000000

Średnia wynosi 21,9; mediana - 23.

### Zadanie 2

Bazując na ramce danych utworzonej w poprzednim zadaniu, wyświetl czwarty wiersz. Następnie zapisz do osobnej ramki tych uczniów, którzy uzyskali wynik powyżej średniej.

In [34]:
scores_df.iloc[[3]]

     imię  liczba punktów
3  Michał              17

In [35]:
above_average_df = scores_df[scores_df['liczba punktów'] > scores_df['liczba punktów'].mean()]
above_average_df

         imię  liczba punktów
0        Adam              27
1     Malwina              28
2       Beata              25
4  Franciszka              25
8      Monika              25

### Zadanie 3

Dodaj do ramki trzecią kolumnę, w której znajdzie się procentowy wynik uczniów i uczennic z tego egzaminu (to znaczy, że każda wartość liczbowa musi zostać podzielona przez maksimum punktów, jaki można było na tym egzaminie uzyskać). 

Następnie, chcemy zanonimizować kolumnę z imionami: chcemy, by została tylko pierwsza i ostatnia litera imienia. Np. dla imienia “Marcelina” chcemy zachować “M...a”

In [36]:
scores_df['procenty'] = scores_df['liczba punktów'] * 100 / 30
scores_df

         imię  liczba punktów   procenty
0        Adam              27  90.000000
1     Malwina              28  93.333333
2       Beata              25  83.333333
3      Michał              17  56.666667
4  Franciszka              25  83.333333
5     Paulina              18  60.000000
6      Maciej              20  66.666667
7       Piotr              13  43.333333
8      Monika              25  83.333333
9       Diana              21  70.000000

In [37]:
scores_df['imię'] = scores_df['imię'].apply(lambda x: f"{x[0]}...{x[-1]}")
scores_df

    imię  liczba punktów   procenty
0  A...m              27  90.000000
1  M...a              28  93.333333
2  B...a              25  83.333333
3  M...ł              17  56.666667
4  F...a              25  83.333333
5  P...a              18  60.000000
6  M...j              20  66.666667
7  P...r              13  43.333333
8  M...a              25  83.333333
9  D...a              21  70.000000

### Zadanie 4

Posortuj ramkę danych względem liczby punktów otrzymanych z egzaminu, od najwyższego do najniższego. W przypadku takiej samej liczby punktów, osoby mają zostać wyświetlone w odwrotnej kolejności alfabetycznej.

In [38]:
scores_df = scores_df.sort_values(by=['liczba punktów', 'imię'], ascending=[False, False])
scores_df

    imię  liczba punktów   procenty
1  M...a              28  93.333333
0  A...m              27  90.000000
8  M...a              25  83.333333
4  F...a              25  83.333333
2  B...a              25  83.333333
9  D...a              21  70.000000
6  M...j              20  66.666667
5  P...a              18  60.000000
3  M...ł              17  56.666667
7  P...r              13  43.333333

### Zadanie 5

Połącz ze sobą dwie poniższe ramki.



```
student_data1 = pd.DataFrame({
    'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
    'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin']
    })

student_data2 = pd.DataFrame({
    'student_id': ['S6', 'S7', 'S8', 'S9', 'S10'],
    'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston']
    })
```

In [39]:
student_data1 = pd.DataFrame({
    'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
    'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin']
    })

student_data2 = pd.DataFrame({
    'student_id': ['S6', 'S7', 'S8', 'S9', 'S10'],
    'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston']
    })

In [40]:
student_data = student_data1.append(student_data2)
student_data

  student_id              name
0         S1  Danniella Fenton
1         S2      Ryder Storey
2         S3      Bryce Jensen
3         S4         Ed Bernal
4         S5       Kwame Morin
0         S6  Scarlette Fisher
1         S7  Carla Williamson
2         S8       Dante Morse
3         S9    Kaiser William
4        S10   Madeeha Preston

### Zadanie 6

Do ramki utworzonej w poprzednim zadaniu dodaj informacje o rezultatach studentów z ramki poniżej.



```
exam_results = pd.DataFrame({
    'student_id': ['S2', 'S10', 'S3', 'S1', 'S7', 'S9', 'S5', 'S4', 'S8', 'S6'],
    'marks': [200, 210, 190, 222, 199, 201, 200, 198, 219, 201]
    })
```

In [41]:
exam_results = pd.DataFrame({
    'student_id': ['S2', 'S10', 'S3', 'S1', 'S7', 'S9', 'S5', 'S4', 'S8', 'S6'],
    'marks': [200, 210, 190, 222, 199, 201, 200, 198, 219, 201]
    })

exam_results

  student_id  marks
0         S2    200
1        S10    210
2         S3    190
3         S1    222
4         S7    199
5         S9    201
6         S5    200
7         S4    198
8         S8    219
9         S6    201

In [42]:
students_results =  pd.merge(student_data, exam_results, on='student_id')
students_results

  student_id              name  marks
0         S1  Danniella Fenton    222
1         S2      Ryder Storey    200
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    198
4         S5       Kwame Morin    200
5         S6  Scarlette Fisher    201
6         S7  Carla Williamson    199
7         S8       Dante Morse    219
8         S9    Kaiser William    201
9        S10   Madeeha Preston    210